### Tasks

1. **Import the employee record dataset and save it to a MySQL database**.
2. **Fetch the table using `fetchall()` and `read_sql_query()`**.
3. **Query the database to find employees making over $60,000**.
4. **Return the average salary for each department**.
5. **Find the highest-paid employee and their department**.
6. **Identify employees hired before 2020-01-01**.

In [1]:
### 1. Import the dataset and save it to a MySQL database

import pandas as pd
import mysql.connector
from getpass import getpass
from mysql.connector import connect, Error

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
# Load the dataset
file_path = 'employees_record_data.csv'
df = pd.read_csv(file_path)

In [3]:
df.shape

(17, 5)

In [4]:
df.head()

           Name          Job Title  Department  Salary   HireDate
0    John Smith            Manager  Management  100000  1 01 2020
1      Jane Doe    Sales Associate       Sales   50000  1 06 2019
2   Bob Johnson  Assistant Manager  Management   75000  1 03 2018
3  Mary Johnson    Sales Associate       Sales   45000  1 02 2021
4     Kevin Lee            Analyst     Finance   80000  1 07 2020

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        17 non-null     object
 1   Job Title   17 non-null     object
 2   Department  17 non-null     object
 3   Salary      17 non-null     int64
 4   HireDate    17 non-null     object
dtypes: int64(1), object(4)
memory usage: 808.0+ bytes

In [7]:
# Convert 'hire_date' column to the correct format
df['HireDate'] = pd.to_datetime(df['HireDate'], format='%d %m %Y').dt.strftime('%Y-%m-%d')

df.head()

           Name          Job Title  Department  Salary    HireDate
0    John Smith            Manager  Management  100000  2020-01-01
1      Jane Doe    Sales Associate       Sales   50000  2019-06-01
2   Bob Johnson  Assistant Manager  Management   75000  2018-03-01
3  Mary Johnson    Sales Associate       Sales   45000  2021-02-01
4     Kevin Lee            Analyst     Finance   80000  2020-07-01

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        17 non-null     object
 1   Job Title   17 non-null     object
 2   Department  17 non-null     object
 3   Salary      17 non-null     int64
 4   HireDate    17 non-null     object
dtypes: int64(1), object(4)
memory usage: 808.0+ bytes

In [10]:
password=getpass("Enter password: ")

Enter password: ········

In [11]:
# 127.0.0.1:3306
conn = connect(host="localhost",user="root",
        password=password)
cursor = conn.cursor()

In [12]:
delete_db_query = "DROP DATABASE IF EXISTS `Employees_Records`"
cursor.execute(delete_db_query)

In [13]:
create_db_query = "CREATE DATABASE Employees_Records"
cursor.execute(create_db_query)

In [14]:
show_db_query = "SHOW DATABASES"
cursor.execute(show_db_query)
for db in cursor:
    print(db)

('employees_records',)
('information_schema',)
('invoicing',)
('mysql',)
('online_movie_rating',)
('performance_schema',)
('store',)
('sys',)

In [15]:
#connecting to an existing database

conn = connect(host="localhost",user="root",
        password=password,database="employees_records")
cursor = conn.cursor()

In [16]:
# Create table
create_table_query = """
CREATE TABLE IF NOT EXISTS employees (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(255),
    department VARCHAR(255),
    salary FLOAT,
    hire_date DATE
);
"""
cursor.execute(create_table_query)

In [17]:
show_table_query = "SHOW TABLES"
cursor.execute(show_table_query)
for tb in cursor:
    print(tb)

('employees',)

In [22]:
# for index, row in df.iterrows():
#     print(row['Job Title'])

# created DB emplyees_rec
# created table employees
# csv - df 
# df.iterrows - to save data - from df - to - table emplyees

In [23]:
# Insert data into the table
for index, row in df.iterrows():
    cursor.execute(
        "INSERT INTO employees (name, department, salary, hire_date) VALUES ( %s, %s, %s, %s)",
        ( row['Name'], row['Department'], row['Salary'], row['HireDate'])
    )

conn.commit()

# Close the cursor and connection
cursor.close()
conn.close()

In [25]:
conn = connect(host="localhost",user="root",
        password=password,database="employees_records")
cursor = conn.cursor()

select_reviewers_query = "SELECT * FROM employees"
cursor.execute(select_reviewers_query)
result = cursor.fetchall()
for row in result:
    print(row)
    
# Close the cursor and connection
cursor.close()
conn.close()

(1, 'John Smith', 'Management', 100000.0, datetime.date(2020, 1, 1))
(2, 'Jane Doe', 'Sales', 50000.0, datetime.date(2019, 6, 1))
(3, 'Bob Johnson', 'Management', 75000.0, datetime.date(2018, 3, 1))
(4, 'Mary Johnson', 'Sales', 45000.0, datetime.date(2021, 2, 1))
(5, 'Kevin Lee', 'Finance', 80000.0, datetime.date(2020, 7, 1))
(6, 'Sophia Martinez', 'Customer Service', 71000.0, datetime.date(2018, 9, 12))
(7, 'Emma Thomas', 'Research', 59000.0, datetime.date(2019, 11, 30))
(8, 'Liam Taylor', 'Finance', 72000.0, datetime.date(2015, 7, 22))
(9, 'Ava White', 'Engineering', 67000.0, datetime.date(2020, 9, 18))
(10, 'Noah Martin', 'HR', 55000.0, datetime.date(2019, 3, 3))
(11, 'Isabella Hall', 'IT', 78000.0, datetime.date(2018, 5, 29))
(12, 'Ethan Garcia', 'Marketing', 65000.0, datetime.date(2016, 10, 12))
(13, 'Mia Lopez', 'Operations', 72000.0, datetime.date(2017, 8, 8))
(14, 'Alexander Hill', 'Sales', 60000.0, datetime.date(2022, 4, 5))
(15, 'Charlotte Clark', 'Research', 73000.0, datetime.date(2019, 9, 2))
(16, 'Daniel Lewis', 'IT', 69000.0, datetime.date(2018, 1, 14))
(17, 'Harper Adams', 'Marketing', 85000.0, datetime.date(2016, 6, 7))

In [31]:
### 2. Fetch the table using `fetchall()` and `read_sql_query()`

#connecting to an existing database

conn = connect(host="localhost",user="root",
        password=password,database="employees_records")
cursor = conn.cursor()


# Fetch all records using fetchall()
cursor.execute("SELECT * FROM employees")
records = cursor.fetchall()

# Print records
for record in records:
    print(record)

(1, 'John Smith', 'Management', 100000.0, datetime.date(2020, 1, 1))
(2, 'Jane Doe', 'Sales', 50000.0, datetime.date(2019, 6, 1))
(3, 'Bob Johnson', 'Management', 75000.0, datetime.date(2018, 3, 1))
(4, 'Mary Johnson', 'Sales', 45000.0, datetime.date(2021, 2, 1))
(5, 'Kevin Lee', 'Finance', 80000.0, datetime.date(2020, 7, 1))
(6, 'Sophia Martinez', 'Customer Service', 71000.0, datetime.date(2018, 9, 12))
(7, 'Emma Thomas', 'Research', 59000.0, datetime.date(2019, 11, 30))
(8, 'Liam Taylor', 'Finance', 72000.0, datetime.date(2015, 7, 22))
(9, 'Ava White', 'Engineering', 67000.0, datetime.date(2020, 9, 18))
(10, 'Noah Martin', 'HR', 55000.0, datetime.date(2019, 3, 3))
(11, 'Isabella Hall', 'IT', 78000.0, datetime.date(2018, 5, 29))
(12, 'Ethan Garcia', 'Marketing', 65000.0, datetime.date(2016, 10, 12))
(13, 'Mia Lopez', 'Operations', 72000.0, datetime.date(2017, 8, 8))
(14, 'Alexander Hill', 'Sales', 60000.0, datetime.date(2022, 4, 5))
(15, 'Charlotte Clark', 'Research', 73000.0, datetime.date(2019, 9, 2))
(16, 'Daniel Lewis', 'IT', 69000.0, datetime.date(2018, 1, 14))
(17, 'Harper Adams', 'Marketing', 85000.0, datetime.date(2016, 6, 7))

In [33]:
# Fetch all records using read_sql_query()
empl_df = pd.read_sql_query("SELECT * FROM employees", conn)
empl_df.head()

C:\Users\omcar\AppData\Local\Temp\ipykernel_4364\2813950244.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  empl_df = pd.read_sql_query("SELECT * FROM employees", conn)

   id          name  department    salary   hire_date
0   1    John Smith  Management  100000.0  2020-01-01
1   2      Jane Doe       Sales   50000.0  2019-06-01
2   3   Bob Johnson  Management   75000.0  2018-03-01
3   4  Mary Johnson       Sales   45000.0  2021-02-01
4   5     Kevin Lee     Finance   80000.0  2020-07-01

In [38]:
empl_df.groupby('department').mean('salary')

                         id        salary
department
Customer Service   6.000000  71000.000000
Engineering        9.000000  67000.000000
Finance            6.500000  76000.000000
HR                10.000000  55000.000000
IT                13.500000  73500.000000
Management         2.000000  87500.000000
Marketing         14.500000  75000.000000
Operations        13.000000  72000.000000
Research          11.000000  66000.000000
Sales              6.666667  51666.666667

In [34]:
# Close the cursor and connection
cursor.close()
conn.close()

In [35]:
### 3. Find the names and salaries of employees that make over $60,000

#connecting to an existing database

conn = connect(host="localhost",user="root",
        password=password,database="employees_records")
cursor = conn.cursor()

# Query to find employees making over $60,000
query = "SELECT name, salary FROM employees WHERE salary > 60000"
df_high_salary = pd.read_sql_query(query, conn)
df_high_salary

C:\Users\omcar\AppData\Local\Temp\ipykernel_4364\3439783165.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_high_salary = pd.read_sql_query(query, conn)

               name    salary
0        John Smith  100000.0
1       Bob Johnson   75000.0
2         Kevin Lee   80000.0
3   Sophia Martinez   71000.0
4       Liam Taylor   72000.0
5         Ava White   67000.0
6     Isabella Hall   78000.0
7      Ethan Garcia   65000.0
8         Mia Lopez   72000.0
9   Charlotte Clark   73000.0
10     Daniel Lewis   69000.0
11     Harper Adams   85000.0

In [36]:
# Close the connection
conn.close()

In [39]:
### 4. Return the average salary for each department

#connecting to an existing database

conn = connect(host="localhost",user="root",
        password=password,database="employees_records")
cursor = conn.cursor()

# Query to return the average salary for each department
query = "SELECT department, AVG(salary) as average_salary FROM employees GROUP BY department"
df_avg_salary = pd.read_sql_query(query, conn)
df_avg_salary

C:\Users\omcar\AppData\Local\Temp\ipykernel_4364\2177124226.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_avg_salary = pd.read_sql_query(query, conn)

         department  average_salary
0        Management    87500.000000
1             Sales    51666.666667
2           Finance    76000.000000
3  Customer Service    71000.000000
4          Research    66000.000000
5       Engineering    67000.000000
6                HR    55000.000000
7                IT    73500.000000
8         Marketing    75000.000000
9        Operations    72000.000000

In [ ]:
# Close the connection
conn.close()

In [42]:
### 5. Find the highest-paid employee and their department

#connecting to an existing database

conn = connect(host="localhost",user="root",
        password=password,database="employees_records")
cursor = conn.cursor()

# Query to find the highest-paid employee and their department
query = """
SELECT name, department, salary 
FROM employees 
ORDER BY salary DESC 
LIMIT 1
"""
df_highest_paid = pd.read_sql_query(query, conn)
df_highest_paid

C:\Users\omcar\AppData\Local\Temp\ipykernel_4364\840097965.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_highest_paid = pd.read_sql_query(query, conn)

         name  department    salary
0  John Smith  Management  100000.0

In [43]:
# Close the connection
conn.close()

In [44]:
### 6. Identify employees hired before 2020-01-01

#connecting to an existing database

conn = connect(host="localhost",user="root",
        password=password,database="employees_records")
cursor = conn.cursor()

# Query to find employees hired before 2020-01-01
query = "SELECT * FROM employees WHERE hire_date < '2020-01-01'"
df_hired_before_2020 = pd.read_sql_query(query, conn)
df_hired_before_2020

C:\Users\omcar\AppData\Local\Temp\ipykernel_4364\3239033373.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_hired_before_2020 = pd.read_sql_query(query, conn)

    id             name        department   salary   hire_date
0    2         Jane Doe             Sales  50000.0  2019-06-01
1    3      Bob Johnson        Management  75000.0  2018-03-01
2    6  Sophia Martinez  Customer Service  71000.0  2018-09-12
3    7      Emma Thomas          Research  59000.0  2019-11-30
4    8      Liam Taylor           Finance  72000.0  2015-07-22
5   10      Noah Martin                HR  55000.0  2019-03-03
6   11    Isabella Hall                IT  78000.0  2018-05-29
7   12     Ethan Garcia         Marketing  65000.0  2016-10-12
8   13        Mia Lopez        Operations  72000.0  2017-08-08
9   15  Charlotte Clark          Research  73000.0  2019-09-02
10  16     Daniel Lewis                IT  69000.0  2018-01-14
11  17     Harper Adams         Marketing  85000.0  2016-06-07

In [45]:
# Close the connection
conn.close()